12/data/attachments/c5da7ccb2bba5d88.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:sendInvitationRequest>
            <nif:username>Shannon_thank_Actions_12674_3</nif:username>
            <nif:friendToBeRequested>soap_actions_e0f9dee1-0ec6-4b6c-b516-04b7e82d8ed8</nif:friendToBeRequested>
        </nif:sendInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>